In [1]:
import pandas as pd
a=[1,7,10]
my1=pd.Series(a)
print(my1)

0     1
1     7
2    10
dtype: int64

In [3]:
print(my1[0])

1

In [5]:
my1=pd.Series(a,index=["X","Y","Z"])
print(my1)

X     1
Y     7
Z    10
dtype: int64

In [7]:
my2={101:"azar",102:"mohamed",103:"raja"}
result=pd.Series(my2,index=[101,102])
print(result)

101       azar
102    mohamed
dtype: object

In [ ]:
#DataFrames

In [9]:
data={"c1":[100,200,300],"c2":[400,500,600]}
my1=pd.DataFrame(data)
print(my1)

    c1   c2
0  100  400
1  200  500
2  300  600

In [11]:
#LocateRows
print(my1.loc[0])

c1    100
c2    400
Name: 0, dtype: int64

In [13]:
my2=pd.DataFrame(data,index=["d1","d2","d3"])
print(my2)

     c1   c2
d1  100  400
d2  200  500
d3  300  600

In [15]:
print(my2.loc["d1"])

c1    100
c2    400
Name: d1, dtype: int64

In [17]:
df=pd.read_csv("Datasets/Position_Salaries.csv")
df

            Position  Level   Salary
0   Business Analyst      1    45000
1  Junior Consultant      2    50000
2  Senior Consultant      3    60000
3            Manager      4    80000
4    Country Manager      5   110000
5   Regional Manager      6   150000
6            Partner      7   200000
7     Senior Partner      8   300000
8            C-level      9   500000
9                CEO     10  1000000

In [19]:
print(pd.options.display.max_columns)

0

In [21]:
print(pd.options.display.min_rows)

10

In [25]:
import pandas as pd
data={'One':pd.Series([1,2,3,4],index=['a','b','c','d']),
     'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
table=pd.DataFrame(data)
print(table)

   One  two
a    1    1
b    2    2
c    3    3
d    4    4

In [27]:
#DataFrame add and delete the column
data={'One':pd.Series([1,2,3,4],index=['a','b','c','d']),
     'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
table=pd.DataFrame(data)
table['three']=pd.Series([10,20,30,40],index=['a','b','c','d'])
print(table)

   One  two  three
a    1    1     10
b    2    2     20
c    3    3     30
d    4    4     40

In [29]:
del table['One']
print(table)

   two  three
a    1     10
b    2     20
c    3     30
d    4     40

In [31]:
table.pop('two')
print(table)

   three
a     10
b     20
c     30
d     40

In [ ]:
#DataFrames add and delete of rows

In [33]:
print(table.loc['a'])
print(table)

three    10
Name: a, dtype: int64
   three
a     10
b     20
c     30
d     40

In [37]:
import pandas as pd

# Suppose you already have a DataFrame
table = pd.DataFrame([[1,2,3],[4,5,6]], columns=['One','two','three'])

# New rows to add
row = pd.DataFrame([[11,12,13],[14,15,16]], columns=['One','two','three'])

# Append using pd.concat
table = pd.concat([table, row], ignore_index=True)

print(table)

   One  two  three
0    1    2      3
1    4    5      6
2   11   12     13
3   14   15     16

In [43]:
table=table.drop(0)

In [45]:
table

   One  two  three
1    4    5      6
2   11   12     13
3   14   15     16

In [49]:
df_test=pd.DataFrame(np.random.rand(5,5),['A','B','C','D','E'],['W','X','Y','Z','A'])
df_test

          W         X         Y         Z         A
A  0.214562  0.087613  0.524403  0.685126  0.717302
B  0.849238  0.703643  0.097435  0.262433  0.722612
C  0.130174  0.081361  0.569926  0.572386  0.214639
D  0.603261  0.295386  0.831415  0.720924  0.299015
E  0.086377  0.667174  0.896692  0.890378  0.818619

In [51]:
print(df_test[['W','A']])

          W         A
A  0.214562  0.717302
B  0.849238  0.722612
C  0.130174  0.214639
D  0.603261  0.299015
E  0.086377  0.818619

In [53]:
print(df_test.loc['A'])

W    0.214562
X    0.087613
Y    0.524403
Z    0.685126
A    0.717302
Name: A, dtype: float64

In [55]:
print(df_test.loc[['A'],['W']])

          W
A  0.214562

In [57]:
df_test['NEWCOL']=df_test['W']+df_test['X']
df_test

          W         X         Y         Z         A    NEWCOL
A  0.214562  0.087613  0.524403  0.685126  0.717302  0.302175
B  0.849238  0.703643  0.097435  0.262433  0.722612  1.552881
C  0.130174  0.081361  0.569926  0.572386  0.214639  0.211536
D  0.603261  0.295386  0.831415  0.720924  0.299015  0.898647
E  0.086377  0.667174  0.896692  0.890378  0.818619  0.753551

In [59]:
df_test.shape

(5, 6)

In [61]:
print(df_test[(df_test['NEWCOL']>1)])

          W         X         Y         Z         A    NEWCOL
B  0.849238  0.703643  0.097435  0.262433  0.722612  1.552881

In [63]:
df_test.to_excel('test1.xlsx',sheet_name="mysheet")
df_test

          W         X         Y         Z         A    NEWCOL
A  0.214562  0.087613  0.524403  0.685126  0.717302  0.302175
B  0.849238  0.703643  0.097435  0.262433  0.722612  1.552881
C  0.130174  0.081361  0.569926  0.572386  0.214639  0.211536
D  0.603261  0.295386  0.831415  0.720924  0.299015  0.898647
E  0.086377  0.667174  0.896692  0.890378  0.818619  0.753551